# Value Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyDistance..::..Value Property
AssetPropertyDistance Class See Also
---
Value of the property.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Value { get; set; }
```

Visual Basic
---
```text
Public Property Value As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Value {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The input value is invalid for this AssetPropertyDistance property. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The asset property is not editable. |

# See Also
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace